Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: In this scenario, it’s useful to combine an unowned property on one class with an implicitly unwrapped optional property on the other class.
ja: この筋書きにおいて、一方のクラス上の非所有プロパティと他方のクラス上の暗黙的にアンラップされるオプショナルのプロパティを結合することは、役に立ちます。

source: In this situation, the parameter name takes precedence, and it becomes necessary to refer to the property in a more qualified way.
ja: この状況には、パラメータ名が優先されます、そして、より対象を限定するやり方でプロパティに言及することが必要になります。

source: In this version of the game, the first action in the loop is to check for a ladder or a snake.
ja: ゲームのこの改作において、ループでの最初の活動は、はしごまたはヘビについて調べることです。

source: In-Out Parameters
ja: In-Outパラメータ

source: In-out parameters are an alternative way for a function to have an effect outside of the scope of its function body.
ja: in-outパラメータは、その関数本体のスコープの外で効果を持つようにする関数のための代替の方法です。

source: In-out parameters are discussed in In-Out Parameters.
ja: in-outパラメータは、in-outパラメータで議論されます。

source: In-out parameters are discussed in detail in In-Out Parameters, below.
ja: in-outパラメータは詳細に、下で、in-outパラメータにおいて議論されます。

source: In-out parameters are not the same as returning a value from a function.
ja: in-outパラメータは、関数からある値が返されることと同じではありません。

source: In-out parameters are passed as follows:
ja: in-outパラメータは、以下のように渡されます：

source: In-out parameters cannot have default values, and variadic parameters cannot be marked as inout.
ja: In-outパラメータは省略時の値を持つことができません、そして可変長パラメータはinoutとして印されることができません。

source: Includes a new section on Extended Grapheme Clusters and more information about Unicode Scalar Values and Comparing Strings.
ja: 拡張書記素クラスタに関する新しい節そしてユニコードスカラー値と文字列を比較するについての更なる情報を含めました。

source: Including a default or @unknown default case when switching over a frozen enumeration produces a warning because that code is never executed.
ja: defaultまたは@unknown defaultケース節を、凍結列挙に対してスイッチしている時に含めることは、警告を生成します、なぜならそのコードは決して遂行されないからです。

source: Indeed, if you are writing a single-target app, you may not need to specify explicit access control levels at all.
ja: 実際に、あなたが単一ターゲットのアプリを書いているならば、明確なアクセス制御水準を指定する必要はまったくありません。

source: Indeed, if you delete the typealias Item = Int line from the code above, everything still works, because it’s clear what type should be used for Item.
ja: 本当に、あなたが上のコードから行typealias Item = Intを削除するならば、すべては依然として働きます、なぜなら、どんな型がItemのために使われなければならないかは明白であるからです。

source: Indeed, if you tried to access the instance, your app would most likely crash.
ja: 実はそれどころか、あなたがそのインスタンスにアクセスしようとするならば、あなたのアプリはたぶんクラッシュするでしょう。

source: Indentation at the start of each quoted line is removed, as long as it matches the indentation of the closing quotation marks.
ja: 各引用された行の始まりでの字下げは、それが終了引用符の字下げと合致する分だけは、取り除かれます。

source: Inferring Type From Context
ja: 文脈から型を推論する

source: Inferring parameter and return value types from context
ja: 前後関係からパラメータおよび戻り値の型を推論する

source: Infix Operator Methods no longer require the @infix attribute.
ja: 接中辞演算子メソッドはもはや@infix属性を必要としません。

source: Infix operators can optionally specify a precedence group.
ja: 接中辞演算子は、任意に優先順位グループを指定することができます。

source: Inheritance
ja: 継承

source: Inheritance enables one class to inherit the characteristics of another.
ja: 継承は、あるクラスが他のものの特徴を受け継ぐのを可能にします。

source: Inheritance is a fundamental behavior that differentiates classes from other types in Swift.
ja: 継承は、スウィフトにおいてクラスを他の型と区別する基本的挙動です。

source: Initial values for the properties of the new instance can be passed to the memberwise initializer by name.
ja: 新しいインスタンスのプロパティのための初期値は、名前でメンバー関連イニシャライザに渡されることができます。

source: Initial values for the properties of the new instance can be passed to the memberwise initializer by name:
ja: 新しいインスタンスのプロパティのための最初の値は、名前によってメンバー関連イニシャライザに渡されることができます：

source: Initialization
ja: 初期化

source: Initialization Parameters
ja: 初期化パラメータ

source: Initialization failure propagates through initializer delegation.
ja: 初期化失敗は、イニシャライザ委任を通じて伝えられます。

source: Initialization parameters have the same capabilities and syntax as function and method parameters.
ja: 初期化パラメータは、関数およびメソッドのパラメータと同じ能力と構文を持ちます。

source: Initializer Declaration
ja: イニシャライザ宣言

source: Initializer Delegation for Class Types
ja: クラス型のためのイニシャライザ委任

source: Initializer Delegation for Value Types
ja: 値型のためのイニシャライザ委任

source: Initializer Expression
ja: イニシャライザ式

source: Initializer Inheritance and Overriding
ja: イニシャライザの継承およびオーバーライド

source: Initializer Parameters Without Argument Labels
ja: 引数ラベルのないイニシャライザ・パラメータ

source: Initializer Requirements
ja: イニシャライザ要件

source: Initializer declarations are declared using the init keyword and have two basic forms.
ja: イニシャライザ宣言は、キーワードinitを使って宣言されて、２つの基本の書式を持ちます。

source: Initializers
ja: イニシャライザ

source: Initializers are described in more detail in Initialization.
ja: イニシャライザは、更に詳細に初期化で記述されます。

source: Initializers are now able to access self and can modify its properties, call its instance methods, and so on.
ja: イニシャライザは、今ではselfにアクセスすることができます、そしてそれのプロパティを修正すること、それのインスタンスをメソッドを呼び出すこと、などが行えます。

source: Initializers can call other initializers to perform part of an instance’s initialization.
ja: イニシャライザは、あるインスタンスの初期化の一部を実行するために他のイニシャライザを呼ぶことができます。

source: Initializers can delegate to other initializers in the enumeration, but the initialization process is complete only after an initializer assigns one of the enumeration cases to self.
ja: イニシャライザは、その列挙の中の他のイニシャライザに委任することができます、しかしその初期化処理はあるイニシャライザが列挙ケース節のうちの１つをselfに代入した後になって初めて終了します。

source: Initializers in structures and enumerations can call other declared initializers to delegate part or all of the initialization process.
ja: 構造体および列挙のイニシャライザは、初期化プロセスの一部または全てを委任するために他の宣言済みイニシャライザを呼ぶことができます。

source: Initializing an Empty String
ja: 空の文字列を初期化する

source: Initializing from a Raw Value
ja: 生の値から初期化する

source: Inlinable code can interact with public symbols declared in any module, and it can interact with internal symbols declared in the same module that are marked with the usableFromInline attribute.
ja: インライン可能コードは、何らかのモジュールにおいて宣言されるpublicシンボルと相互作用できます、そしてそれは同じモジュールにおいて宣言されるinternalシンボルで、usableFromInline属性で印されるものと相互作用できます。

source: Inlinable code can’t interact with private or fileprivate symbols.
ja: インライン可能コードは、privateまたはfileprivateシンボルと相互作用できません。

source: Inserting -9 and 4 into the equation yields:
ja: -9と4を等式に入れることは、以下を生じます：

source: Inserting 9 and 4 into this equation yields:
ja: 9と4をこの等式に入れることは、以下を生じます：

source: Inserting and Removing
ja: 差し込みと削除

source: Inside a closure with no explicit parameter names, the parameters are implicitly named $0, $1, $2, and so on.
ja: 明確なパラメータ名のないクロージャの内部で、パラメータは暗黙のうちに$0、$1、$2、などと名前をつけられます。

source: Inside a function, the value of #function is the name of that function, inside a method it is the name of that method, inside a property getter or setter it is the name of that property, inside special members like init or subscript it is the name of that keyword, and at the top level of a file it is the name of the current module.
ja: 関数の内側では、#functionの値は、その関数の名前であり、メソッドの内側ではそれはそのメソッドの名前であり、プロパティゲッターやセッターの内側ではそれはそのプロパティの名前であり、initまたはsubscriptのような特別なメンバーの内側ではそれはそのキーワードの名前であり、そしてあるファイルのトップレベルではそれは現在のモジュールの名前です。

source: Inside a nested type declaration, the Self type refers to the type introduced by the innermost type declaration.
ja: 入れ子にされた型宣言の内部で、Self型は、最も内側の型宣言によって導入された型を参照します。

source: Inside a protocol declaration, a type alias can give a shorter and more convenient name to a type that is used frequently.
ja: プロトコル宣言の内部で、型エイリアスはより短くより便利な名前を頻繁に使われる型に提供できます。

source: Inside the do block, you mark code that can throw an error by writing try in front of it.
ja: doブロックの内部で、あなたはエラーをスローできるコードを、それの前にtryを書くことによって印します。

source: Inside the catch block, the error is automatically given the name error unless you give it a different name.
ja: catchブロック内部で、エラーは、あなたがそれに別の名前を与えるのでない限り、自動的に名前errorを与えられます。

source: Inside the declaration for a member of a type, the Self type refers to that type.
ja: ある型のメンバーに対する宣言の内部で、Self型は、その型を参照します。

source: Inside the switch, the enumeration case is referred to by the abbreviated form .hearts because the value of self is already known to be a suit.
ja: スイッチの内側では、列挙のケース節は省略された形式.heartsによって参照されます、なぜならselfの値がすでに組み札のひとつ（スペード、クラブ、ハート、ダイヤのどれか）であるということがわかっているからです。

source: Instance Methods
ja: インスタンスメソッド

source: Instance methods added with an extension can also modify (or mutate) the instance itself.
ja: 拡張を使って加えられるインスタンスメソッドは、また、インスタンスそれ自体を修正（または変更）することができます。

source: Instance methods have exactly the same syntax as functions, as described in Functions.
ja: インスタンスメソッドは、関数と正確に同じ構文を持ちます、関数で記述されるように。

source: Instance methods, as described above, are methods that you call on an instance of a particular type.
ja: インスタンスメソッドは、上で記述されるように、あなたが特定の型のインスタンス上で呼び出すメソッドです。

source: Instance properties are properties that belong to an instance of a particular type.
ja: インスタンスプロパティは、ある特定の型のあるひとつのインスタンスに属しているプロパティです。

source: Instance subscripts, as described above, are subscripts that you call on an instance of a particular type.
ja: インスタンス添え字は、上で記述されるように、あなたがある特定の型のインスタンス上で呼び出す添え字です。

source: Instances of FixedLengthRange have a variable stored property called firstValue and a constant stored property called length.
ja: FixedLengthRangeのインスタンスはfirstValueと呼ばれる変数格納プロパティとlengthと呼ばれる定数格納プロパティをもちます。

source: Instances of Hamster can now be used wherever TextRepresentable is the required type:
ja: TextRepresentableが必要な型であるどこででも、Hamsterのインスタンスが現在使われることができます：

source: Instances of class types can also implement a deinitializer, which performs any custom cleanup just before an instance of that class is deallocated.
ja: クラス型のインスタンスはまた、デイニシャライザを実装することができます、それは、そのクラスのインスタンスの割り当て解除がされる直前に、何らかのあつらえのクリーンアップ作業を実行します。

source: Instead of generating a random number, it starts with a diceRoll value of 0.
ja: 無作為な数を生成する代わりに、それは0のdiceRoll値から始めます。

source: Instead of making a copy immediately, these collections share the memory where the elements are stored between the original instance and any copies.
ja: あるコピーを直接に作る代わりに、それらコレクションは要素が格納されるところのメモリを、元のインスタンスと何らかのコピーの間で共有します。

source: Instead of making an explicit call to super.init(), this initializer relies on an implicit call to its superclass’s initializer to complete the process.
ja: super.init()への明示的な呼び出しをする代わりに、このイニシャライザはそれのスーパークラスの持つイニシャライザへの暗黙的な呼び出しを当てにすることで、その過程を完了します。

source: Instead of providing a concrete type as the function’s return type, the return value is described in terms of the protocols it supports.
ja: ある具象型を関数のもつ戻り型として提供する代わりに、戻り値はそれがサポートするプロトコルそれらの観点から記述されます。

source: Instead of returning a new point, this method actually modifies the point on which it is called.
ja: 新しい点を返す代わりに、このメソッドは、それが呼び出された点を実際に修正します。

source: Instead, Rect defines a custom getter and setter for a computed variable called center, to enable you to work with the rectangle’s center as if it were a real stored property.
ja: その代わりに、Rectは、centerと呼ばれる計算される変数のためにあつらえのゲッターとセッターを定義して、矩形のcenterをそれがまったく格納プロパティであるかのようにあなたが扱うことができるようにします。

source: Instead, a literal is parsed as having infinite precision and Swift’s type inference attempts to infer a type for the literal.
ja: そうではなく、リテラルは無限精度を持つものとして解析されて、スウィフトの型推論はそのリテラルの型を推測することを試みます。

source: Instead, it makes more sense to create the DataImporter instance if and when it is first used.
ja: その代わりに、それが最初に必要とされる時になればDataImporterを作成するほうが筋が通ります。

source: Instead, make an explicit check against nil with the == or != operators to find out if an optional contains a value.
ja: その代わりに、nilに備えて、==または!=演算子を使ってオプショナルが値を持つかどうか確認するために明示的に調べてください。

source: Instead, the Stack type’s existing type parameter name, Element, is used within the extension to indicate the optional type of the topItem computed property.
ja: そうしなくても、Stack型の既存の型パラメーター名、Elementは、拡張の内部でtopItem計算プロパティの元々の型を指し示すために使われることができます。

source: Instead, the addition assignment operator method takes advantage of the existing addition operator method, and uses it to set the left value to be the left value plus the right value:
ja: 代わりに、追加代入演算子メソッドは、既存の加算演算子メソッドを利用して、左の値を右の値を加えた左の値に設定するためにそれを使います：

source: Instead, the different enumeration cases are values in their own right, with an explicitly defined type of CompassPoint.
ja: その代わりに、異なる列挙ケース節それらは、ある明示的に定義されたCompassPointの型を持つ、自分だけのものである値です。

source: Instead, the entire switch statement finishes its execution as soon as the first matching switch case is completed, without requiring an explicit break statement.
ja: その代わりに、最初のマッチしているswitchケース節の部分が完了されるとすぐに、switch文の全体がその実行を終えます、明確なbreak文を必要としません。

source: Instead, the loop is executed until a particular condition is satisfied.
ja: その代わりに、このループは特定の条件が満たされるまで実行されます。

source: Instead, the protocol’s own access level is used to provide the default access level for each protocol requirement implementation within the extension.
ja: その代わりに、プロトコル自身のアクセス水準が、省略時のアクセス水準を拡張内の各プロトコル要件実施のために提供するために使われます。

source: Instead, the type parameter list from the original type definition is available within the body of the extension, and the original type parameter names are used to refer to the type parameters from the original definition.
ja: そうしなくても、元々の型定義からの型パラメーターリストは、その拡張の本文内で利用可能です、そして元々の型パラメーター名は、元々の定義からの型パラメーターを参照するために使われます。

source: Instead, these references are defined like any other constant or variable in Swift.
ja: その代わりに、これらの参照は、スウィフトにおけるあらゆる他の定数または変数と同じように定義されます。

source: Instead, they are called only when the value is set outside of an initialization context.
ja: そうではなく、値が初期化の文脈の外で設定されるときにだけ、それらは呼ばれます。

source: Instead, they provide a getter and an optional setter to retrieve and set other properties and values indirectly.
ja: その代わりに、それらは他のプロパティや値を間接的に取得したり設定したりするためにゲッターと任意のセッターを提供します。

source: Instead, this example calls UInt16(one) to create a new UInt16 initialized with the value of one, and uses this value in place of the original:
ja: その代わりに、この例はoneの値で初期化される新しいUInt16を作るためにUInt16(one)を呼んで、オリジナルの代わりにこの値を使います：

source: Instead, use separate available attributes to specify a Swift version availability and one or more platform availabilities.
ja: 代わりに、available属性を使うことで、スウィフトバージョン利用可能性と１つ以上のプラットホーム利用可能性を指定してください。

source: Instead, use the append(_:) method, or append a single-item array with the += operator.
ja: その代わりに、append(_:)メソッドを使ってください、または単一項目の配列を+=演算子を使って加えてください。

source: Integer Bounds
ja: 整数の限界

source: Integer Conversion
ja: 整数変換

source: Integer Literals
ja: 整数リテラル

source: Integer and Floating-Point Conversion
ja: 整数と浮動小数点の変換

source: Integer literals can be written as:
ja: 整数リテラルは、次のように書かれることができます：

source: Integer literals can begin with leading zeros (0), but they’re likewise ignored and don’t affect the base or value of the literal.
ja: 整数リテラルは、いくつかのゼロ（0）を先頭に始まることができます、しかしそれらは同様に無視されて、リテラルの基数または値に影響を及ぼしません。

source: Integers
ja: 整数

source: Integers are checked for overflow.
ja: 整数は、オーバーフローを確認される。

source: Integers are either signed (positive, zero, or negative) or unsigned (positive or zero).
ja: 整数は、符号つき（正、ゼロ、または負）または符号なし（正またはゼロ）のどちらかです。

source: Interface Builder attributes are declaration attributes used by Interface Builder to synchronize with Xcode.
ja: いくつかのインターフェイスビルダー属性は、Xcodeと同期するためにインターフェイスビルダーによって使用される宣言属性です。

source: Interval Matching
ja: 区間マッチング

source: It adds a director property on top of the base MediaItem class, with a corresponding initializer.
ja: それは、対応するイニシャライザを使って、基盤クラスMediaItemの上にdirectorプロパティを加えます。

source: It also cannot transfer control into a case block whose pattern contains value binding patterns.
ja: それはまた、パターンが値束縛パターンを含むケース節ブロックに制御を移すことができません。

source: It also defines a computed property called description, which uses the values stored in rank and suit to build a description of the name and value of the card.
ja: それはまた、descriptionと呼ばれる計算プロパティを定義します、それは、rankとsuitに保管される値を使って、カードの名前と説明の値を作ります。

source: It also defines an array of integers, ready to be converted into strings.
ja: それはまた、文字列に変換される準備ができている整数の配列も定義します。

source: It also means you can be confident about the type of values you will retrieve from a collection.
ja: それはまた、あなたがコレクションから取り出す値の型をあなたが確信できることを意味します。

source: It also offers two methods—distribute(coins:) and receive(coins:)—to handle the distribution and collection of coins.
ja: それはまた、２つのメソッド ― distribute(coins:)とreceive(coins:)— ― を提供して、コインの配布と回収を取り扱います。

source: It also provides a method called complete(level:), which is called whenever a player completes a particular level.
ja: それはまたcomplete(level:)と呼ばれるメソッドを提供します、それは、プレーヤーが特定のレベルを完了するときはいつでも呼び出されます。

source: It also tracks the current level for an individual player.
ja: それはまた、個々のプレーヤーのために現在のレベルを追跡します。

source: It appends a colon and a line break, and uses this as the start of its pretty text representation.
ja: それはコロンと改行を追加します、そしてそれのきれいなテキスト表示のスタートとして、これを使います。

source: It calculates the last digit of number by using the remainder operator (number % 10), and uses this digit to look up an appropriate string in the digitNames dictionary.
ja: それは、numberの最後の桁を剰余演算子を使用することによって計算して（number % 10）、この桁をdigitNames辞書で適切な文字列を捜すために使います。

source: It calls the provided function with the values 3 and 5, and prints the result of 8.
ja: それは、提供された関数を値3と5を使って呼び出して、結果の8を出力します。

source: It can accept member names using an argument of a type that conforms to the ExpressibleByStringLiteral [https://developer.apple.com/documentation/swift/expressiblebystringliteral] protocol—in most cases, String.
ja: それはメンバー名を、ExpressibleByStringLiteral [https://developer.apple.com/documentation/swift/expressiblebystringliteral]プロトコルに準拠する型 — ほとんどの場合、String — の引数を使って受け入れ可能です。

source: It can also be useful to define requirements for associated types.
ja: 関連型のために要件を定義することは、また同様に役に立ちます。

source: It can also match a value with a range of values, by checking whether the value is contained within the range, as the following example shows.
ja: それはまた、ある値をある範囲の値と照合することが、その値がその範囲に含まれるかどうかを調べることによって可能です、以下の例が示すように。

source: It can be described as “a tuple of type (Int, String)”.
ja: それは型(Int, String)のタプルとして記述されることができます。

source: It can be read as “not a”, as seen in the following example:
ja: それは、「aでない」のように読まれることができます、下記の例では見られるように：

source: It can be useful to require a type to conform to multiple protocols at the same time.
ja: ある型に複数のプロトコルに一時に従うことを要求することは、役に立つことがありえます。

source: It can do this with a control transfer statement such as return, break, continue, or throw, or it can call a function or method that doesn’t return, such as fatalError(_:file:line:).
ja: それはこれを制御移動文return、break、continue、またはthrowなどで行えます、またはそれは復帰しない関数やメソッド、例えばfatalError(_:file:line:)を呼ぶことができます。

source: It can sometimes be useful to find out whether two constants or variables refer to exactly the same instance of a class.
ja: ２つの定数または変数が正確にあるクラスの同じインスタンスに言及するかどうかについて、探り出すことは時々役に立つことがあります。

source: It cannot be called in isolation without an existing instance.
ja: それは、単独で既存のインスタンスなしで呼ばれることができません。

source: It cannot be modified by a subclass.
ja: それは、サブクラスによって修正されることができません。

source: It can’t call any other initializers of the same class, and if the class has a superclass, it must call one of the superclass’s designated initializers.
ja: それは同じクラスの他のどのイニシャライザも呼ぶことができません、そしてそのクラスがスーパークラスを持つならば、それはスーパークラスの指定イニシャライザのうちの１つを呼ばなければなりません。

source: It can’t contain three unescaped double quotation marks next to each other.
ja: それは、お互いは別として３つのエスケープされない二重引用符を含むことが出来ません。

source: It compares the new value of totalSteps against the old value.
ja: それは、totalStepsの新しい値をその古い値と比較します。

source: It consists of a period (.) between the item and the identifier of its member.
ja: それは、その項目とそれのメンバーの識別子の間のピリオド（.）から成ります。

source: It delegates across to a designated initializer from the same class.
ja: それは、横の同じクラスの指定イニシャライザに向かって委任します。

source: It does this by capturing a reference to runningTotal and amount from the surrounding function and using them within its own function body.
ja: それは、それを囲んでいる関数からrunningTotalとamountへの参照を捕獲して、それらをそれ自身の関数本文内で使うことによってこれを行います。

source: It does this by implementing the optional fixedIncrement property requirement:
ja: それは、オプショナルのfixedIncrementプロパティ要件を実装することによってこれをします：

source: It doesn’t make sense for volume to be settable, because it would be ambiguous as to which values of width, height, and depth should be used for a particular volume value.
ja: volumeが設定可能であることは意味をなしません、なぜなら特定のvolume値に対してwidth、height、そしてdepthにどの値が使われなければならないかはあいまいだからです。

source: It doesn’t matter that "zebra" isn’t less than "apple", because the comparison is already determined by the tuples’ first elements.
ja: "zebra"が"apple"より少ないことは問題ではありません、この比較はすでにタプルの最初の要素によって決定されているからです。

source: It doesn’t matter what that function’s implementation actually does—it matters only that the function is of the correct type.
ja: その関数の実装が実際に何をするかは、重要ではありません ― ただ関数が正しい型であるのが重要です。

source: It doesn’t take any arguments, and when it’s called, it returns the value of the expression that’s wrapped inside of it.
ja: それは、全く引数を取りません、そしてそれが呼ばれる時、その内部に包み込まれた式の値を返します。

source: It doubles the x and y values of a Vector2D instance, by adding the vector to itself with the addition assignment operator defined earlier.
ja: それはVector2Dインスタンスのxとy値を、そのベクトルをそれ自体へと以前に定義される加算代入演算子を使って加えることによって２倍にします。

source: It enables you to represent almost any character from any language in a standardized form, and to read and write those characters to and from an external source such as a text file or web page.
ja: それは、あなたにほとんどどんな文字でもどんな言語のものでも標準化された方式で表わすこと、そしてそれらの文字を、テキスト・ファイルやウェブ・ページのような外部のソースへ書き込んだり、それらから読み込んだりすることを可能にします。

source: It evaluates an addition or multiplication by evaluating the expression on the left-hand side, evaluating the expression on the right-hand side, and then adding them or multiplying them.
ja: それは加算や乗算を、左手側の式を評価し、右手側の式を評価して、それからそれらを加算や乗算することで評価します。

source: It executes a set of statements only if that condition is true.
ja: それは、その条件がtrueの場合にだけ、あるひとまとめにした文を実行します。

source: It explicitly converts the count from Int to Double to be able to do floating-point division.
ja: それは、明示的に総数をIntからDoubleへ変換して、浮動小数点除算ができるようにします。

source: It has already been initialized with the value contained within the optional, and so there’s no need to use the ! suffix to access its value.
ja: それは、すでにオプショナルの内部に含まれる値で初期化されています、それでその値にアクセスするために!接尾辞を使う必要はありません。

source: It has one of the following forms:
ja: それは、以下の書式のうちの１つを持ちます：

source: It has the following form:
ja: それは、以下の形式を持ちます：

source: It has the following forms:
ja: それは、以下の各形式を持ちます：

source: It illustrates how the designated initializers in this hierarchy act as “funnel” points for class initialization, simplifying the interrelationships among classes in the chain:
ja: それは、この階層の中の指定イニシャライザが、どのようにクラス初期化のために「漏斗」地点の働きをして、この連鎖におけるクラス間の相互関係を単純化しているかを図示します：

source: It introduces an Int property called quantity (in addition to the name property it inherits from Food) and defines two initializers for creating RecipeIngredient instances:
ja: それは、quantityと呼ばれるIntプロパティ（加えてそれがFoodから受け継ぐnameプロパティ）を導入して、そしてRecipeIngredientインスタンスをつくるために２つのイニシャライザを定義します：

source: It is a single-player game, but can store information for multiple players on a single device.
ja: それはシングルプレーヤーのゲームです、しかし１つの装置上で複数のプレーヤーのために情報を蓄えることができます。

source: It is always better to be specific about the types you expect to work with in your code.
ja: いつでもより望ましいのは、あなたのコードで扱うことをあなたが期待する型について明確にすることです。

source: It is always possible to infer the parameter types and return type when passing a closure to a function or method as an inline closure expression.
ja: クロージャを関数やメソッドに行内クロージャ式として渡すとき、パラメータ型と戻り型を推論することは常に可能です。

source: It is automatically assigned a default value of nil, meaning “no string yet”, when a new instance of SurveyQuestion is initialized.
ja: それは、SurveyQuestionの新しいインスタンスは初期化される時に、「まだ無い文字列」を意味する、省略時の値のnilを自動的に代入されます。

source: It is explained in detail below in Capturing Values.
ja: それは、下で詳細に値を捕獲する（キャプチャする）の中で説明されます。

source: It is good practice to create immutable collections in all cases where the collection does not need to change.
ja: そのコレクションを変更する必要がないすべての場合において不変のコレクションを作成することは良い習慣です。
